[
    {
      "name": "Barbara Wynn, MD",
      "location": "Grand Rapids, MI",
      "quote": "Having practiced Emergency Medicine for many years, avoiding burnout has been a constant challenge. Scribes have enabled me to have more focus for my patients, my team, and myself as well as more enthusiasm about going to work. I believe effective use of scribes could be critical in preventing physician/provider burnout and should be encouraged throughout the health care system."
    },
    {
      "name": "Bethany Beard, MD",
      "location": "Grand Rapids, MI",
      "quote": "Documenting without a scribe can be very distracting during a patient encounter. A scribe takes this distraction away and allows me to focus on the patient, engage with them socially, make eye contact, and observe them clinically so I know what's really going on with them. Patient satisfaction is also greatly increased when speaking directly to the physician and not into the back of their clipboard or computer."
    },
    {
      "name": "Ryan Peters, DO",
      "location": "Grand Rapids, MI",
      "quote": "Scribes allow a heightened level of patient and family communication that is not possible if I am responsible for taking notes or performing in-the-moment documentation. I am free to focus more on history gathering and am confident that important details are being accurately recorded for me. They also provide an element of job satisfaction and wellness that comes from shared documentation demands."
    },
    {
      "name": "Christopher Benner, MD",
      "location": "Grand Rapids, MI",
      "quote": "I have found working with scribes to be very helpful. I am still able to maintain an efficient pace while it is much easier to keep up on charting with the help of a scribe. I have noticed that I leave my shifts much closer to the time they are supposed to end than before which makes the work-life balance a little easier."
    },
    {
      "name": "Andrew Fras, MD",
      "location": "East Grand Rapids, MI",
      "quote": "Scribing has worked miracles for improving my efficiency in chart completion as well as maintaining a high level of detail to my notes. I was spending 6-8 hours/week completing charts outside of office hours. I now spend about 1-2 hours after office and have them completed within 24 hours usually. I can improve on this as well as I streamline my note details, etc."
    },
    {
      "name": "Jackson Lanphear, MD",
      "location": "Grand Rapids, MI",
      "quote": "It was a long time waiting for the addition of scribes and I was very excited to start working with one. Now that I have been working with them for many years, it has been a tremendous improvement in the overall clinical work environment. I look forward to every one of my shifts with a scribe and am bummed when I don't have one."
    },
    {
      "name": "Bhawana Arora, MD",
      "location": "Grand Rapids, MI",
      "quote": "I had heard great things about medical scribes from my physician friends in other programs who have had them for a while. My friends always expressed how they left on time after shifts and had satisfactory documentation. So when ECS decided to hire scribes for medical documentation, I was very excited. As any other physician, I did have concerns that they might do inappropriate documentation thereby increasing my work and putting me at medical legal risk. However after working with them, I have had very few problems in documentation and those were easily addressed. It’s great to not worry about charting while working in high ED turn over areas and still be able to leave on time on most of my shifts."
    },
    {
      "name": "Bruce Murray, MD",
      "location": "Grand Rapids, MI",
      "quote": "Having practiced EM for over 20 years, the last thing I wanted was another person following me around and for me to explain all my thoughts. At the same time our volume was increasing and I often spent one to two hours after my shift doing paperwork. As I contemplated leaving Emergency Medicine I heard we were getting scribes and decided to give it a try. I now have a renewed passion for my career thanks to these wonderful scribes. I have told everyone they have been a true 'Godsend' and a blessing to me. I am now out on time on most days, see more patients, spend more time with them at the bedside, and my stress level is zero most days. If you have not worked with scribes, I strongly urge you to try it out. You may decide not to be one of the 'burned out' EM physicians."
    }
  ]
  